<details ><summary>apply for devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5 2025-04-17 09:41:26 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project cryptocat-org/devops-digger#devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5 has been locked by PR #5
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # module.autoscaling["on-demand"].aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "t1-skeleton-eu-central-1-mycluster5-on-demand"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = true
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = [
          + "ClosestToNextInstanceHour",
        ]
      + vpc_zone_identifier              = [
          + "subnet-053a16c57de39a913",
          + "subnet-066b03e1bba5c2a40",
          + "subnet-06a3a0d84e1d42cc4",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "t1"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "t1-skeleton-eu-central-1-mycluster5-on-demand"
        }
      + tag {
          + key                 = "Namespace"
          + propagate_at_launch = true
          + value               = "skeleton"
        }
      + tag {
          + key                 = "Region"
          + propagate_at_launch = true
          + value               = "eu-central-1"
        }

      + timeouts {}

      + traffic_source (known after apply)
    }

  # module.autoscaling["on-demand"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
      + tags        = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all    = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + unique_id   = (known after apply)
    }

  # module.autoscaling["on-demand"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for t1-skeleton-eu-central-1-mycluster5"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all              = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
    }

  # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
    }

  # module.autoscaling["on-demand"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Launch template t1-skeleton-eu-central-1-mycluster5"
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = "t1-skeleton-eu-central-1-mycluster5-on-demand-lt"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all               = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9dDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUKRUNTX0xPR0xFVkVMPWRlYnVnCkVDU19DT05UQUlORVJfSU5TVEFOQ0VfVEFHUz17IkVudmlyb25tZW50IjoidDEiLCJOYW1lIjoidDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUiLCJOYW1lc3BhY2UiOiJza2VsZXRvbiIsIlJlZ2lvbiI6ImV1LWNlbnRyYWwtMSJ9CkVDU19FTkFCTEVfVEFTS19JQU1fUk9MRT10cnVlCkVPRgoK"
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile (known after apply)

      + metadata_options (known after apply)

      + monitoring {
          + enabled = true
        }
    }

  # module.autoscaling_sg.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Autoscaling group security group for t1-skeleton-eu-central-1-mycluster5"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "t1-skeleton-eu-central-1-mycluster5-asg-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all               = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + vpc_id                 = "vpc-0d651a804166ac3a4"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/t1-skeleton-eu-central-1-mycluster5"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all          = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
    }

  # module.ecs_cluster.aws_ecs_capacity_provider.this["on-demand"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "t1-skeleton-eu-central-1-mycluster5-on-demand"
      + tags     = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 5
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 60
            }
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "t1-skeleton-eu-central-1-mycluster5"
      + tags     = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }
      + tags_all = {
          + "Environment" = "t1"
          + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
          + "Namespace"   = "skeleton"
          + "Region"      = "eu-central-1"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "t1-skeleton-eu-central-1-mycluster5-on-demand",
        ]
      + cluster_name       = "t1-skeleton-eu-central-1-mycluster5"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "t1-skeleton-eu-central-1-mycluster5-on-demand"
          + weight            = 60
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn                            = (known after apply)
  + cluster_autoscaling_capacity_providers = {
      + on-demand = {
          + arn                         = (known after apply)
          + auto_scaling_group_provider = [
              + {
                  + auto_scaling_group_arn         = (known after apply)
                  + managed_draining               = (known after apply)
                  + managed_scaling                = [
                      + {
                          + instance_warmup_period    = (known after apply)
                          + maximum_scaling_step_size = 5
                          + minimum_scaling_step_size = 1
                          + status                    = "ENABLED"
                          + target_capacity           = 60
                        },
                    ]
                  + managed_termination_protection = "ENABLED"
                },
            ]
          + id                          = (known after apply)
          + name                        = "t1-skeleton-eu-central-1-mycluster5-on-demand"
          + tags                        = {
              + Environment = "t1"
              + Name        = "t1-skeleton-eu-central-1-mycluster5"
              + Namespace   = "skeleton"
              + Region      = "eu-central-1"
            }
          + tags_all                    = {
              + Environment = "t1"
              + Name        = "t1-skeleton-eu-central-1-mycluster5"
              + Namespace   = "skeleton"
              + Region      = "eu-central-1"
            }
        }
    }
  + cluster_capacity_providers             = (known after apply)
  + cluster_id                             = (known after apply)
  + cluster_name                           = "t1-skeleton-eu-central-1-mycluster5"
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Creating...
module.autoscaling["on-demand"].aws_iam_role.this[0]: Creating...
module.autoscaling_sg.aws_security_group.this[0]: Creating...
module.autoscaling["on-demand"].aws_iam_role.this[0]: Creation complete after 0s [id=t1-skeleton-eu-central-1-mycluster5-on-demand-role]
module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"]: Creating...
module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"]: Creating...
module.autoscaling["on-demand"].aws_iam_instance_profile.this[0]: Creating...
module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"]: Creation complete after 1s [id=t1-skeleton-eu-central-1-mycluster5-on-demand-role-20250417094214480500000001]
module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"]: Creation complete after 1s [id=t1-skeleton-eu-central-1-mycluster5-on-demand-role-20250417094214654500000002]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Creation complete after 1s [id=/aws/ecs/t1-skeleton-eu-central-1-mycluster5]
module.ecs_cluster.aws_ecs_cluster.this[0]: Creating...
module.autoscaling_sg.aws_security_group.this[0]: Creation complete after 3s [id=sg-0ab4299295b839e96]
module.autoscaling_sg.aws_security_group_rule.egress_rules[0]: Creating...
module.autoscaling_sg.aws_security_group_rule.egress_rules[0]: Creation complete after 1s [id=sgrule-1009758014]
module.autoscaling["on-demand"].aws_iam_instance_profile.this[0]: Creation complete after 7s [id=t1-skeleton-eu-central-1-mycluster5-on-demand-role]
module.autoscaling["on-demand"].aws_launch_template.this[0]: Creating...
module.ecs_cluster.aws_ecs_cluster.this[0]: Still creating... [10s elapsed]
module.ecs_cluster.aws_ecs_cluster.this[0]: Creation complete after 11s [id=arn:aws:ecs:eu-central-1:052701461513:cluster/t1-skeleton-eu-central-1-mycluster5]
module.autoscaling["on-demand"].aws_launch_template.this[0]: Creation complete after 6s [id=lt-02fef57f77c5e91b3]
module.autoscaling["on-demand"].aws_autoscaling_group.idc[0]: Creating...
module.autoscaling["on-demand"].aws_autoscaling_group.idc[0]: Still creating... [10s elapsed]
module.autoscaling["on-demand"].aws_autoscaling_group.idc[0]: Still creating... [20s elapsed]
module.autoscaling["on-demand"].aws_autoscaling_group.idc[0]: Creation complete after 29s [id=t1-skeleton-eu-central-1-mycluster5-on-demand]
module.ecs_cluster.aws_ecs_capacity_provider.this["on-demand"]: Creating...
module.ecs_cluster.aws_ecs_capacity_provider.this["on-demand"]: Creation complete after 1s [id=arn:aws:ecs:eu-central-1:052701461513:capacity-provider/t1-skeleton-eu-central-1-mycluster5-on-demand]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Creating...
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Still creating... [10s elapsed]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Creation complete after 11s [id=t1-skeleton-eu-central-1-mycluster5]

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.

Outputs:

cluster_arn = "arn:aws:ecs:eu-central-1:052701461513:cluster/t1-skeleton-eu-central-1-mycluster5"
cluster_autoscaling_capacity_providers = {
  "on-demand" = {
    "arn" = "arn:aws:ecs:eu-central-1:052701461513:capacity-provider/t1-skeleton-eu-central-1-mycluster5-on-demand"
    "auto_scaling_group_provider" = tolist([
      {
        "auto_scaling_group_arn" = "arn:aws:autoscaling:eu-central-1:052701461513:autoScalingGroup:305dee4d-d4b9-48bd-97f5-f08e944ac61e:autoScalingGroupName/t1-skeleton-eu-central-1-mycluster5-on-demand"
        "managed_draining" = "ENABLED"
        "managed_scaling" = tolist([
          {
            "instance_warmup_period" = 0
            "maximum_scaling_step_size" = 5
            "minimum_scaling_step_size" = 1
            "status" = "ENABLED"
            "target_capacity" = 60
          },
        ])
        "managed_termination_protection" = "ENABLED"
      },
    ])
    "id" = "arn:aws:ecs:eu-central-1:052701461513:capacity-provider/t1-skeleton-eu-central-1-mycluster5-on-demand"
    "name" = "t1-skeleton-eu-central-1-mycluster5-on-demand"
    "tags" = tomap({
      "Environment" = "t1"
      "Name" = "t1-skeleton-eu-central-1-mycluster5"
      "Namespace" = "skeleton"
      "Region" = "eu-central-1"
    })
    "tags_all" = tomap({
      "Environment" = "t1"
      "Name" = "t1-skeleton-eu-central-1-mycluster5"
      "Namespace" = "skeleton"
      "Region" = "eu-central-1"
    })
  }
}
cluster_capacity_providers = {
  "t1-skeleton-eu-central-1-mycluster5" = {
    "capacity_providers" = toset([
      "t1-skeleton-eu-central-1-mycluster5-on-demand",
    ])
    "cluster_name" = "t1-skeleton-eu-central-1-mycluster5"
    "default_capacity_provider_strategy" = toset([
      {
        "base" = 20
        "capacity_provider" = "t1-skeleton-eu-central-1-mycluster5-on-demand"
        "weight" = 60
      },
    ])
    "id" = "t1-skeleton-eu-central-1-mycluster5"
  }
}
cluster_id = "arn:aws:ecs:eu-central-1:052701461513:cluster/t1-skeleton-eu-central-1-mycluster5"
cluster_name = "t1-skeleton-eu-central-1-mycluster5"

```
</details>

</details>